In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:DemoEldohub@localhost:3306/md_water_services

In [5]:
%%sql
SHOW TABLES;

   mysql+pymysql://root:***@localhost:3306
 * mysql+pymysql://root:***@localhost:3306/md_water_services
8 rows affected.

[('data_dictionary',),
 ('employee',),
 ('global_water_access',),
 ('location',),
 ('visits',),
 ('water_quality',),
 ('water_source',),
 ('well_pollution',)]

In [7]:
%%sql
SELECT *
FROM data_dictionary
LIMIT 20;

   mysql+pymysql://root:***@localhost:3306
 * mysql+pymysql://root:***@localhost:3306/md_water_services
20 rows affected.

[('employee', 'assigned_employee_id', 'Unique ID assigned to each employee', 'INT', 'visits'),
 ('employee', 'employee_name', 'Name of the employee', 'VARCHAR(255)', ''),
 ('employee', 'phone_number', 'Contact number of the employee', 'VARCHAR(15)', ''),
 ('employee', 'email', 'Email address of the employee', 'VARCHAR(255)', ''),
 ('employee', 'address', 'Residential address of the employee', 'VARCHAR(255)', ''),
 ('employee', 'town_name', 'Name of the town where the employee resides', 'VARCHAR(255)', ''),
 ('employee', 'province_name', 'Name of the province where the employee resides', 'VARCHAR(255)', ''),
 ('employee', 'position', 'Position or job title of the employee', 'VARCHAR(255)', ''),
 ('visits', 'record_id', 'Unique ID assigned to each visit', 'int', 'water_quality, water_source'),
 ('visits', 'location_id', 'ID of the location visited', 'varchar(255)', 'location'),
 ('visits', 'source_id', 'ID of the water source visited', 'varchar(510)', 'well_pollution'),
 ('visits', 'time_of_record', 'Date and time of the visit', 'datetime', ''),
 ('visits', 'visit_count', 'Number of visits made to this location', 'int', ''),
 ('visits', 'time_in_queue', 'Time spent by people waiting for water in a queue at the location', 'int', ''),
 ('visits', 'assigned_employee_id', 'ID of the employee who visited the location', 'int', 'employee'),
 ('water_quality', 'record_id', 'Unique ID assigned to each record', 'int', ''),
 ('water_quality', 'subjective_quality_score', 'Score representing the subjective quality of the water source', 'int', ''),
 ('water_quality', 'visit_count', 'Number of visits made for data collection', 'int', ''),
 ('water_source', 'source_id', 'Unique ID assigned to each water source', 'VARCHAR(510)', 'visits'),
 ('water_source', 'type_of_water_source', 'Type or category of the water source. Can be : tap_in_home, tap_in_home_broken, well, shared_tap, river', 'VARCHAR(255)', '')]

In [9]:
%%sql
SELECT * FROM location 
LIMIT 5;

   mysql+pymysql://root:***@localhost:3306
 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('AkHa00000', '2 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban'),
 ('AkHa00001', '10 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban'),
 ('AkHa00002', '9 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban'),
 ('AkHa00003', '139 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban'),
 ('AkHa00004', '17 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban')]

In [10]:
%%sql
SELECT * FROM visits
LIMIT 5;

   mysql+pymysql://root:***@localhost:3306
 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[(0, 'SoIl32582', 'SoIl32582224', datetime.datetime(2021, 1, 1, 9, 10), 1, 15, 12),
 (1, 'KiRu28935', 'KiRu28935224', datetime.datetime(2021, 1, 1, 9, 17), 1, 0, 46),
 (2, 'HaRu19752', 'HaRu19752224', datetime.datetime(2021, 1, 1, 9, 36), 1, 62, 40),
 (3, 'AkLu01628', 'AkLu01628224', datetime.datetime(2021, 1, 1, 9, 53), 1, 0, 1),
 (4, 'AkRu03357', 'AkRu03357224', datetime.datetime(2021, 1, 1, 10, 11), 1, 28, 14)]

In [11]:
%%sql
SELECT * FROM water_source
LIMIT 5;

   mysql+pymysql://root:***@localhost:3306
 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('AkHa00000224', 'tap_in_home', 956),
 ('AkHa00001224', 'tap_in_home_broken', 930),
 ('AkHa00002224', 'tap_in_home_broken', 486),
 ('AkHa00003224', 'well', 364),
 ('AkHa00004224', 'tap_in_home_broken', 942)]

In [13]:
%%sql
SELECT DISTINCT type_of_water_source
FROM water_source

   mysql+pymysql://root:***@localhost:3306
 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('tap_in_home',),
 ('tap_in_home_broken',),
 ('well',),
 ('shared_tap',),
 ('river',)]

In [14]:
#stopped at slide no 16

In [3]:
%%sql
SELECT *FROM visits
WHERE time_in_queue>500
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
10 rows affected.

[(899, 'SoRu35083', 'SoRu35083224', datetime.datetime(2021, 1, 16, 10, 14), 6, 515, 28),
 (2304, 'SoKo33124', 'SoKo33124224', datetime.datetime(2021, 2, 6, 7, 53), 5, 512, 16),
 (2315, 'KiRu26095', 'KiRu26095224', datetime.datetime(2021, 2, 6, 14, 32), 3, 529, 8),
 (3206, 'SoRu38776', 'SoRu38776224', datetime.datetime(2021, 2, 20, 15, 3), 5, 509, 46),
 (3701, 'HaRu19601', 'HaRu19601224', datetime.datetime(2021, 2, 27, 12, 53), 3, 504, 0),
 (4154, 'SoRu38869', 'SoRu38869224', datetime.datetime(2021, 3, 6, 10, 44), 2, 533, 24),
 (5483, 'AmRu14089', 'AmRu14089224', datetime.datetime(2021, 3, 27, 18, 15), 4, 509, 12),
 (9177, 'SoRu37635', 'SoRu37635224', datetime.datetime(2021, 5, 22, 18, 48), 2, 515, 1),
 (9648, 'SoRu36096', 'SoRu36096224', datetime.datetime(2021, 5, 29, 11, 24), 2, 533, 3),
 (11631, 'AkKi00881', 'AkKi00881224', datetime.datetime(2021, 6, 26, 6, 15), 6, 502, 32)]

In [5]:
%%sql
SELECT *
FROM water_source
LIMIT 1;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
1 rows affected.

[('AkHa00000224', 'tap_in_home', 956)]

In [6]:
%%sql
SELECT  DISTINCT *
FROM water_source
WHERE source_id IN ("SoRu35083224",	"KiRu26095224")

 * mysql+pymysql://root:***@localhost:3306/md_water_services
2 rows affected.

[('KiRu26095224', 'shared_tap', 3734), ('SoRu35083224', 'shared_tap', 3058)]

In [8]:
%%sql
SELECT *FROM visits
WHERE time_in_queue=0
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
10 rows affected.

[(1, 'KiRu28935', 'KiRu28935224', datetime.datetime(2021, 1, 1, 9, 17), 1, 0, 46),
 (3, 'AkLu01628', 'AkLu01628224', datetime.datetime(2021, 1, 1, 9, 53), 1, 0, 1),
 (6, 'AkRu05234', 'AkRu05234224', datetime.datetime(2021, 1, 1, 10, 18), 1, 0, 30),
 (7, 'KiRu28520', 'KiRu28520224', datetime.datetime(2021, 1, 1, 10, 28), 1, 0, 34),
 (8, 'HaZa21742', 'HaZa21742224', datetime.datetime(2021, 1, 1, 10, 37), 1, 0, 6),
 (9, 'AmDa12214', 'AmDa12214224', datetime.datetime(2021, 1, 1, 10, 58), 1, 0, 36),
 (10, 'HaRu19725', 'HaRu19725224', datetime.datetime(2021, 1, 1, 11, 4), 1, 0, 16),
 (13, 'AkKi00851', 'AkKi00851224', datetime.datetime(2021, 1, 1, 11, 14), 1, 0, 32),
 (14, 'AmDa11956', 'AmDa11956224', datetime.datetime(2021, 1, 1, 11, 16), 1, 0, 6),
 (15, 'SoRu35703', 'SoRu35703224', datetime.datetime(2021, 1, 1, 11, 29), 1, 0, 32)]

In [9]:
%%sql
SELECT  DISTINCT *
FROM water_source
WHERE source_id IN ("KiRu28935224", "HaZa21742224")

 * mysql+pymysql://root:***@localhost:3306/md_water_services
2 rows affected.

[('HaZa21742224', 'well', 308), ('KiRu28935224', 'well', 252)]

In [4]:
%%sql
SELECT *
FROM water_quality
LIMIT 5

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[(0, 0, 1), (1, 1, 1), (2, 5, 1), (3, 10, 1), (4, 4, 1)]

In [24]:
%%sql
SELECT Count(visit_count)
FROM water_quality
WHERE subjective_quality_score = 10 AND visit_count >= 2

 * mysql+pymysql://root:***@localhost:3306/md_water_services
1 rows affected.

[(1526,)]

So please write a query to find records where the subject_quality_score is 10 -- only looking for home taps -- and where the source
was visited a second time. What will this tell us?

In [11]:
%%sql
SELECT *
FROM visits
WHERE visit_count >= 2
LIMIT 10

 * mysql+pymysql://root:***@localhost:3306/md_water_services
10 rows affected.

[(58, 'KiRu30598', 'KiRu30598224', datetime.datetime(2021, 1, 2, 7, 7), 2, 107, 30),
 (59, 'SoRu35008', 'SoRu35008224', datetime.datetime(2021, 1, 2, 7, 27), 2, 248, 1),
 (60, 'HaRu19752', 'HaRu19752224', datetime.datetime(2021, 1, 2, 9, 4), 2, 73, 40),
 (61, 'KiRu27248', 'KiRu27248224', datetime.datetime(2021, 1, 2, 11, 2), 2, 167, 26),
 (62, 'KiRu26190', 'KiRu26190224', datetime.datetime(2021, 1, 2, 13, 56), 2, 200, 46),
 (63, 'KiRu27248', 'KiRu27248224', datetime.datetime(2021, 1, 3, 9, 41), 3, 103, 26),
 (64, 'HaRu19752', 'HaRu19752224', datetime.datetime(2021, 1, 3, 11, 38), 3, 39, 40),
 (65, 'KiRu26190', 'KiRu26190224', datetime.datetime(2021, 1, 3, 12, 0), 3, 112, 46),
 (66, 'KiRu30598', 'KiRu30598224', datetime.datetime(2021, 1, 3, 14, 8), 3, 30, 30),
 (67, 'SoRu35008', 'SoRu35008224', datetime.datetime(2021, 1, 3, 14, 31), 3, 104, 1)]

In [5]:
%%sql
SELECT water_quality.subjective_quality_score AS x, visits.visit_count AS y
FROM water_quality
LEFT JOIN visits ON water_quality.record_id = visits.record_id

WHERE water_quality.subjective_quality_score = 10 AND visits.visit_count >= 2

LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[(10, 2), (10, 3), (10, 4), (10, 5), (10, 2)]

In [20]:
%%sql
SELECT *
FROM water_quality
WHERE subjective_quality_score = 10 AND visit_count >= 2
LIMIT 1

 * mysql+pymysql://root:***@localhost:3306/md_water_services
1 rows affected.

[(59, 10, 2)]

In [21]:
%%sql
SHOW TABLES;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
9 rows affected.

[('data_dictionary',),
 ('employee',),
 ('global_water_access',),
 ('location',),
 ('visits',),
 ('water_quality',),
 ('water_source',),
 ('well_pollution',),
 ('well_pollution_copy',)]

In [9]:
%%sql
SELECT *
FROM well_pollution
LIMIT 10

 * mysql+pymysql://root:***@localhost:3306/md_water_services
10 rows affected.

[('KiRu28935224', datetime.datetime(2021, 1, 4, 9, 17), 'Bacteria: Giardia Lamblia', 0.0, 495.898, 'Contaminated: Biological'),
 ('AkLu01628224', datetime.datetime(2021, 1, 4, 9, 53), 'Bacteria: E. coli', 0.0, 6.09608, 'Contaminated: Biological'),
 ('HaZa21742224', datetime.datetime(2021, 1, 4, 10, 37), 'Inorganic contaminants: Zinc, Zinc, Lead, Cadmium', 2.715, 0.0, 'Contaminated: Chemical'),
 ('HaRu19725224', datetime.datetime(2021, 1, 4, 11, 4), 'Clean', 0.0288593, 9.56996e-05, 'Clean'),
 ('SoRu35703224', datetime.datetime(2021, 1, 4, 11, 29), 'Bacteria: E. coli', 0.0, 22.5009, 'Contaminated: Biological'),
 ('AkHa00070224', datetime.datetime(2021, 1, 4, 11, 42), 'Inorganic contaminants: Cadmium', 5.46739, 0.0, 'Contaminated: Chemical'),
 ('HaSe21346224', datetime.datetime(2021, 1, 4, 11, 52), 'Clean', 0.0140376, 8.98989e-05, 'Clean'),
 ('HaYa21468224', datetime.datetime(2021, 1, 4, 12, 3), 'Inorganic contaminants: Chromium, Barium, Chromium, Lead', 6.05137, 0.0, 'Contaminated: Chemical'),
 ('SoRu36278224', datetime.datetime(2021, 1, 4, 12, 24), 'Parasite: Cryptosporidium', 0.0, 485.162, 'Contaminated: Biological'),
 ('AkLu02155224', datetime.datetime(2021, 1, 4, 12, 29), 'Inorganic contaminants: Selenium, Arsenic', 7.64106, 0.0, 'Contaminated: Chemical')]

In [34]:
%%sql
SELECT *
FROM well_pollution
WHERE results = "Clean" AND biological > 0.01

LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('AkRu08936224', datetime.datetime(2021, 1, 8, 9, 22), 'Bacteria: E. coli', 0.0406458, 35.0068, 'Clean'),
 ('AkRu06489224', datetime.datetime(2021, 1, 10, 9, 44), 'Clean Bacteria: Giardia Lamblia', 0.0897904, 38.467, 'Clean'),
 ('SoRu38011224', datetime.datetime(2021, 1, 14, 15, 35), 'Bacteria: E. coli', 0.0425095, 19.2897, 'Clean'),
 ('AkKi00955224', datetime.datetime(2021, 1, 22, 12, 47), 'Bacteria: E. coli', 0.0812092, 40.2273, 'Clean'),
 ('KiHa22929224', datetime.datetime(2021, 2, 6, 13, 54), 'Bacteria: E. coli', 0.0722537, 18.4482, 'Clean')]

In [18]:
%%sql
SELECT *
FROM well_pollution
WHERE description LIKE 'Clean_%' AND biological > 0.01

limit 1;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
1 rows affected.

[('AkRu06489224', datetime.datetime(2021, 1, 10, 9, 44), 'Clean Bacteria: Giardia Lamblia', 0.0897904, 38.467, 'Clean')]

In [19]:
%%sql
CREATE TABLE well_pollution_copy AS
SELECT * FROM well_pollution

 * mysql+pymysql://root:***@localhost:3306/md_water_services
17383 rows affected.

[]

In [27]:
%%sql
SELECT *
FROM well_pollution_copy
LIMIT 10

 * mysql+pymysql://root:***@localhost:3306/md_water_services
10 rows affected.

[('KiRu28935224', datetime.datetime(2021, 1, 4, 9, 17), 'Bacteria: Giardia Lamblia', 0.0, 495.898, 'Contaminated: Biological'),
 ('AkLu01628224', datetime.datetime(2021, 1, 4, 9, 53), 'Bacteria: E. coli', 0.0, 6.09608, 'Contaminated: Biological'),
 ('HaZa21742224', datetime.datetime(2021, 1, 4, 10, 37), 'Inorganic contaminants: Zinc, Zinc, Lead, Cadmium', 2.715, 0.0, 'Contaminated: Chemical'),
 ('HaRu19725224', datetime.datetime(2021, 1, 4, 11, 4), 'Clean', 0.0288593, 9.56996e-05, 'Clean'),
 ('SoRu35703224', datetime.datetime(2021, 1, 4, 11, 29), 'Bacteria: E. coli', 0.0, 22.5009, 'Contaminated: Biological'),
 ('AkHa00070224', datetime.datetime(2021, 1, 4, 11, 42), 'Inorganic contaminants: Cadmium', 5.46739, 0.0, 'Contaminated: Chemical'),
 ('HaSe21346224', datetime.datetime(2021, 1, 4, 11, 52), 'Clean', 0.0140376, 8.98989e-05, 'Clean'),
 ('HaYa21468224', datetime.datetime(2021, 1, 4, 12, 3), 'Inorganic contaminants: Chromium, Barium, Chromium, Lead', 6.05137, 0.0, 'Contaminated: Chemical'),
 ('SoRu36278224', datetime.datetime(2021, 1, 4, 12, 24), 'Parasite: Cryptosporidium', 0.0, 485.162, 'Contaminated: Biological'),
 ('AkLu02155224', datetime.datetime(2021, 1, 4, 12, 29), 'Inorganic contaminants: Selenium, Arsenic', 7.64106, 0.0, 'Contaminated: Chemical')]

In [26]:
%%sql
UPDATE well_pollution_copy
SET description = 'Bacteria: E. coli'
WHERE description = 'Clean Bacteria: E. coli';

 * mysql+pymysql://root:***@localhost:3306/md_water_services
26 rows affected.

[]

Looking at the results we can see two different descriptions that we need to fix:
1. All records that mistakenly have Clean Bacteria: E. coli should updated to Bacteria: E. coli
2. All records that mistakenly have Clean Bacteria: Giardia Lamblia should updated to Bacteria: Giardia Lamblia

In [28]:
%%sql
UPDATE well_pollution_copy
SET description = 'Bacteria: Giardia Lamblia'
WHERE description = 'Clean Bacteria: Giardia Lamblia';

 * mysql+pymysql://root:***@localhost:3306/md_water_services
12 rows affected.

[]

In [30]:
%%sql
SELECT *
FROM well_pollution_copy
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('KiRu28935224', datetime.datetime(2021, 1, 4, 9, 17), 'Bacteria: Giardia Lamblia', 0.0, 495.898, 'Contaminated: Biological'),
 ('AkLu01628224', datetime.datetime(2021, 1, 4, 9, 53), 'Bacteria: E. coli', 0.0, 6.09608, 'Contaminated: Biological'),
 ('HaZa21742224', datetime.datetime(2021, 1, 4, 10, 37), 'Inorganic contaminants: Zinc, Zinc, Lead, Cadmium', 2.715, 0.0, 'Contaminated: Chemical'),
 ('HaRu19725224', datetime.datetime(2021, 1, 4, 11, 4), 'Clean', 0.0288593, 9.56996e-05, 'Clean'),
 ('SoRu35703224', datetime.datetime(2021, 1, 4, 11, 29), 'Bacteria: E. coli', 0.0, 22.5009, 'Contaminated: Biological')]

In [33]:
%%sql
SELECT *
FROM well_pollution_copy
WHERE description LIKE 'Clean_%' AND biological > 0.01

 * mysql+pymysql://root:***@localhost:3306/md_water_services
0 rows affected.

[]

The second issue we need to fix is in our results column. We need to update the results column from Clean to 
Contaminated: Biological where the biological column has a value greater than 0.01.

In [41]:
%%sql
SELECT *
FROM well_pollution
WHERE results = "Clean" AND biological > 0.01

LIMIT 1;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
0 rows affected.

[]

In [36]:
%%sql
UPDATE well_pollution_copy
SET results = 'Contaminated: Biological'
WHERE biological > 0.01 AND results = 'Clean';

 * mysql+pymysql://root:***@localhost:3306/md_water_services
64 rows affected.

[]

In [38]:
%%sql
SELECT *
FROM well_pollution_copy
WHERE results = "Clean" AND biological > 0.01

 * mysql+pymysql://root:***@localhost:3306/md_water_services
0 rows affected.

[]

In [39]:
%%sql
UPDATE well_pollution
SET description = 'Bacteria: E. coli'
WHERE description = 'Clean Bacteria: E. coli';


UPDATE well_pollution
SET description = 'Bacteria: Giardia Lamblia'
WHERE description = 'Clean Bacteria: Giardia Lamblia';


UPDATE well_pollution
SET results = 'Contaminated: Biological'
WHERE biological > 0.01 AND results = 'Clean';

 * mysql+pymysql://root:***@localhost:3306/md_water_services
26 rows affected.
12 rows affected.
64 rows affected.

[]

In [40]:
%%sql
SELECT *
FROM well_pollution
WHERE results = "Clean" AND biological > 0.01

 * mysql+pymysql://root:***@localhost:3306/md_water_services
0 rows affected.

[]

In [44]:
%%sql
DROP TABLE well_pollution_copy;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
0 rows affected.

[]